documentatie/referentie documentatie/voorbeeld-communicatie-portal-guc-osbgw/part-3.txt

POST /services HTTP/1.1
Content-type: text/xml;charset="utf-8"
X-MULE_CORRELATION_ID: 1295f3ad-85b7-11de-a884-e53af7138924
X-MULE_ENCODING: UTF-8
X-MULE_ENDPOINT: http://twd720.resource.ta-twd.rotterdam.nl:10080/services
X-MULE_ORIGINATING_ENDPOINT: endpoint.http.localhost.63081.stelselBevragenService
X-MULE_REMOTE_CLIENT_ADDRESS: /127.0.0.1:45898
X-MULE_REMOTE_SYNC: true
Soapaction: "http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectTypeListRequest/stelselBevragenService"
User-Agent: Jakarta Commons-HttpClient/3.1
Host: twd720.resource.ta-twd.rotterdam.nl:10080
Content-Length: 767

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:63081/stelselBevragenService</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectTypeListRequest/stelselBevragenService</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:d621440d-b145-4cd5-85f4-a6588c8bbaa7</MessageID></S:Header><S:Body><getObjectTypeList xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"><BRTag>GBA</BRTag></getObjectTypeList></S:Body></S:Envelope>

HTTP/1.1 200 OK
Content-Type: text/plain
Date: Mon, 10 Aug 2009 04:06:56 CEST
Server: Mule Core/1.4.3
Expires: Mon, 10 Aug 2009 04:06:56 CEST
MULE_CORRELATION_ID: 1295f3ad-85b7-11de-a884-e53af7138924
MULE_CORRELATION_GROUP_SIZE: -1
MULE_CORRELATION_SEQUENCE: -1
Content-Length: 2324

<soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To><wsa:MessageID>uuid:b908ff13-247a-48f7-a05e-e41dfb3e21f3</wsa:MessageID><wsa:Action>http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen/getObjectTypeListResponse</wsa:Action><wsa:RelatesTo>uuid:d621440d-b145-4cd5-85f4-a6588c8bbaa7</wsa:RelatesTo></soapenv:Header><soapenv:Body><getObjectTypeListResponse xmlns="http://wus.tmf.gbo.overheid.nl/wsdl/stelselBevragen-V1.1.xsd"><objectTypeList><tag>01</tag><naam>Natuurlijk Persoon</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>06</tag><naam>Overlijden</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>07</tag><naam>Inschrijving</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>08</tag><naam>Verblijfplaats</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>10</tag><naam>Verblijfstitel</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>11</tag><naam>Gezag</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>13</tag><naam>Kiesrecht</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>05</tag><naam>Verbintenis persoon</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>02</tag><naam>Ouderschapsrelatie 1</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>09</tag><naam>Kindrelatie</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>03</tag><naam>Ouderschapsrelatie 2</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>04</tag><naam>Nationaliteit</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList><objectTypeList><tag>12</tag><naam>Reisdocument</naam><bevraagbaar>false</bevraagbaar><instructie></instructie></objectTypeList></getObjectTypeListResponse></soapenv:Body></soapenv:Envelope>
